{
  "intents": [
    {
      "tag": "capital",
      "patterns": ["What is the capital of Norway?"],
      "responses": ["The capital of Norway is Oslo."]
    },
    {
      "tag": "location",
      "patterns": ["Where is Norway located?"],
      "responses": ["Norway is located in Northern Europe, occupying the western part of the Scandinavian Peninsula."]
    },
    {
      "tag": "borders",
      "patterns": ["What countries border Norway?"],
      "responses": ["Norway shares borders with Sweden, Finland, and Russia."]
    },
    {
      "tag": "geography_famous",
      "patterns": ["What is Norway famous for geographically?"],
      "responses": ["Norway is famous for its deep fjords, mountains, glaciers, and a long coastline."]
    },
    {
      "tag": "fjords_definition",
      "patterns": ["What are fjords?"],
      "responses": ["Fjords are long, narrow inlets with steep sides or cliffs, created by glacial erosion. Norway has many famous fjords like Geirangerfjord and Nærøyfjord."]
    },
    {
      "tag": "coastline",
      "patterns": ["Does Norway have a coastline?"],
      "responses": ["Yes, Norway has one of the longest and most rugged coastlines in the world, dotted with thousands of islands."]
    },
    {
      "tag": "highest_mountain",
      "patterns": ["What is the highest mountain in Norway?"],
      "responses": ["The highest mountain in Norway is Galdhøpiggen, standing at 2,469 meters (8,100 feet)."]
    },
    {
      "tag": "northern_lights_visibility",
      "patterns": ["Can you see the Northern Lights in Norway?"],
      "responses": ["Yes, Northern Norway, above the Arctic Circle, is one of the best places in the world to see the Northern Lights (Aurora Borealis), especially during winter."]
    },
    {
      "tag": "northern_lights_best_time",
      "patterns": ["When is the best time to see the Northern Lights in Norway?"],
      "responses": ["The best time to see the Northern Lights in Norway is typically between late September and late March, when the nights are long and dark."]
    },
    {
      "tag": "midnight_sun",
      "patterns": ["What is the Midnight Sun?"],
      "responses": ["The Midnight Sun is a natural phenomenon occurring in summer months in places north of the Arctic Circle (like Northern Norway), where the sun remains visible 24 hours a day."]
    },
    {
      "tag": "islands",
      "patterns": ["What large islands belong to Norway?"],
      "responses": ["Norway administers several large islands and archipelagos, including Svalbard and Jan Mayen in the Arctic."]
    },
    {
      "tag": "mountainous",
      "patterns": ["Is Norway mountainous?"],
      "responses": ["Yes, Norway is a very mountainous country, with large parts dominated by the Scandinavian Mountains range."]
    },
    {
      "tag": "language",
      "patterns": ["What is the official language of Norway?"],
      "responses": ["The official language of Norway is Norwegian. There are two official written forms: Bokmål and Nynorsk. Sámi languages also have official status in some areas."]
    },
    {
      "tag": "currency",
      "patterns": ["What currency is used in Norway?"],
      "responses": ["The official currency of Norway is the Norwegian Krone (NOK)."]
    },
    {
      "tag": "monarchy",
      "patterns": ["Is Norway a monarchy?"],
      "responses": ["Yes, Norway is a constitutional monarchy with a parliamentary system of government. King Harald V is the current monarch."]
    },
    {
      "tag": "population",
      "patterns": ["What is the population of Norway?"],
      "responses": ["The population of Norway is approximately 5.5 million people."]
    },
    {
      "tag": "brunost",
      "patterns": ["What is 'brunost'?"],
      "responses": ["Brunost (brown cheese) is a traditional Norwegian food made from whey, milk, and cream, known for its sweet, caramel-like flavor."]
    },
    {
      "tag": "popular_dish",
      "patterns": ["What is a popular Norwegian dish?"],
      "responses": ["Popular Norwegian dishes include Fårikål (mutton and cabbage stew - the national dish), kjøttkaker (meatballs), salmon, and various seafood dishes."]
    },
    {
      "tag": "national_day",
      "patterns": ["What is Norway's National Day?"],
      "responses": ["Norway's National Day, also known as Constitution Day, is celebrated on May 17th (Syttende Mai)."]
    },
    {
      "tag": "national_day_celebration",
      "patterns": ["How do Norwegians celebrate May 17th?"],
      "responses": ["Norwegians celebrate May 17th with children's parades, traditional costumes (bunad), flags, music, ice cream, and hot dogs."]
    },
    {
      "tag": "koselig",
      "patterns": ["What is 'koselig'?"],
      "responses": ["'Koselig' is a Norwegian word similar to the Danish 'hygge'. It describes a feeling of coziness, intimacy, warmth, and simple pleasures, often shared with loved ones."]
    },
    {
      "tag": "english_proficiency",
      "patterns": ["Are Norwegians good at English?"],
      "responses": ["Yes, proficiency in English is generally very high in Norway, especially among younger generations."]
    },
    {
      "tag": "bunad",
      "patterns": ["What is the 'bunad'?"],
      "responses": ["A bunad is a traditional Norwegian folk costume, with designs specific to different regions. They are often worn for celebrations like May 17th or weddings."]
    },
    {
      "tag": "sami_people",
      "patterns": ["What are the Sámi people?"],
      "responses": ["The Sámi are the indigenous Finno-Ugric people inhabiting the Arctic area of Sápmi, which today encompasses parts of northern Norway, Sweden, Finland, and Russia. They have their own distinct culture, languages, and traditions."]
    },
    {
      "tag": "skiing_popularity",
      "patterns": ["Is skiing popular in Norway?"],
      "responses": ["Yes, skiing is extremely popular in Norway and is considered a national pastime. Norwegians often say they are \"born with skis on their feet.\""]
    },
    {
      "tag": "vikings",
      "patterns": ["Who were the Vikings?"],
      "responses": ["The Vikings were Norse seafarers who, during the Viking Age (roughly 8th to 11th centuries), raided, traded, explored, and settled wide areas of Europe, Asia, and the North Atlantic islands. Many originated from Norway."]
    },
    {
      "tag": "independence",
      "patterns": ["When did Norway become independent?"],
      "responses": ["Norway adopted its constitution in 1814, but full independence from Sweden was achieved peacefully in 1905."]
    },
    {
      "tag": "eu_membership",
      "patterns": ["Is Norway part of the European Union (EU)?"],
      "responses": ["No, Norway is not a member of the European Union. Norwegians have voted against membership in referendums twice (1972 and 1994)."]
    },
    {
      "tag": "eea_membership",
      "patterns": ["Is Norway part of the European Economic Area (EEA)?"],
      "responses": ["Yes, Norway is part of the EEA Agreement, which allows it access to the EU's single market."]
    },
    {
      "tag": "government_type",
      "patterns": ["What kind of government does Norway have?"],
      "responses": ["Norway is a parliamentary constitutional monarchy. Power is divided between the Parliament (Stortinget), the government (led by the Prime Minister), and the courts."]
    },
    {
      "tag": "oil_resources",
      "patterns": ["Does Norway have oil?"],
      "responses": ["Yes, Norway is a major producer and exporter of oil and natural gas, discovered in the North Sea in the late 1960s. This has significantly contributed to its wealth."]
    },
    {
      "tag": "storting",
      "patterns": ["What is the Storting?"],
      "responses": ["The Storting (or Stortinget) is the supreme legislature (parliament) of Norway, located in Oslo."]
    },
    {
      "tag": "cost_of_visit",
      "patterns": ["Is Norway expensive to visit?"],
      "responses": ["Yes, Norway is generally considered one of the more expensive countries in Europe and the world to visit, especially regarding accommodation, food, and alcohol."]
    },
    {
      "tag": "travel_methods",
      "patterns": ["What is the best way to travel around Norway?"],
      "responses": ["Depending on the distance and region, popular ways to travel include driving (car rentals), trains (like the scenic Bergen Railway), buses, domestic flights, and coastal ferries (like Hurtigruten)."]
    },
    {
      "tag": "hurtigruten",
      "patterns": ["What is Hurtigruten?"],
      "responses": ["Hurtigruten is a famous Norwegian coastal ferry service that travels along the coast between Bergen and Kirkenes, stopping at many ports. It functions as transport, postal service, and a popular cruise route."]
    },
    {
      "tag": "popular_cities",
      "patterns": ["What are some popular cities to visit in Norway besides Oslo?"],
      "responses": ["Other popular cities include Bergen (known for Bryggen wharf), Stavanger (gateway to Pulpit Rock), Trondheim (historic city with Nidaros Cathedral), and Tromsø (Arctic city, great for Northern Lights)."]
    },
    {
      "tag": "pulpit_rock",
      "patterns": ["What is Pulpit Rock (Preikestolen)?"],
      "responses": ["Pulpit Rock (Preikestolen) is a famous tourist attraction: a steep cliff rising 604 meters (1,982 feet) above Lysefjorden, known for its large, flat top."]
    },
    {
      "tag": "trolltunga",
      "patterns": ["What is Trolltunga?"],
      "responses": ["Trolltunga ('Troll's Tongue') is another spectacular rock formation, a horizontal piece of rock jutting out about 700 meters (2,300 feet) above Lake Ringedalsvatnet. It requires a long and demanding hike."]
    },
    {
      "tag": "visa_requirements",
      "patterns": ["Do I need a visa to visit Norway?"],
      "responses": ["Whether you need a visa depends on your nationality. Norway is part of the Schengen Area. Citizens of EU/EEA countries generally don't need a visa. Others should check specific requirements."]
    },
    {
      "tag": "emergency_number",
      "patterns": ["What is the emergency phone number in Norway?"],
      "responses": ["The main emergency numbers are: 110 for Fire, 112 for Police, and 113 for Ambulance/Medical emergencies."]
    },
    {
      "tag": "tap_water",
      "patterns": ["Can you drink tap water in Norway?"],
      "responses": ["Yes, tap water in Norway is generally of very high quality and safe to drink throughout the country."]
    },
    {
      "tag": "best_time_to_visit",
      "patterns": ["What is the best time of year to visit Norway?"],
      "responses": ["The best time depends on what you want to do. Summer (June-August) offers milder weather, long daylight hours (Midnight Sun in the north), and is ideal for hiking and fjord exploration. Winter (November-March) is best for Northern Lights, skiing, and snow activities."]
    },
    {
      "tag": "svalbard",
      "patterns": ["What is Svalbard?"],
      "responses": ["Svalbard is a Norwegian archipelago located in the Arctic Ocean, halfway between mainland Norway and the North Pole. It's known for its rugged terrain, glaciers, polar bears, and the Global Seed Vault."]
    },
    {
      "tag": "safety",
      "patterns": ["Is Norway a safe country?"],
      "responses": ["Yes, Norway is generally considered a very safe country with low crime rates."]
    },
    {
      "tag": "welfare_state",
      "patterns": ["What is the Norwegian welfare state?"],
      "responses": ["Norway has a comprehensive welfare state model, funded by taxes and oil revenues, providing universal healthcare, free education (including university), generous parental leave, and strong social safety nets."]
    },
    {
      "tag": "vinmonopolet",
      "patterns": ["What is Vinmonopolet?"],
      "responses": ["Vinmonopolet is the state-owned company with a monopoly on selling alcoholic beverages with an alcohol content higher than 4.75% ABV in Norway."]
    },
    {
      "tag": "trolls",
      "patterns": ["Does Norway have trolls?"],
      "responses": ["Trolls are mythical creatures from Norse mythology and Scandinavian folklore, often depicted in Norwegian culture and souvenirs, but they are creatures of legend, not reality."]
    },
    {
      "tag": "major_industries",
      "patterns": ["What major industries does Norway have apart from oil?"],
      "responses": ["Besides oil and gas, Norway has significant industries in hydropower, fishing and aquaculture (especially salmon), maritime shipping, and increasingly, technology and renewable energy."]
    },
    {
      "tag": "edvard_munch",
      "patterns": ["Who is Edvard Munch?"],
      "responses": ["Edvard Munch was a famous Norwegian painter, best known for his iconic work 'The Scream.'"]
    },
    {
      "tag": "henrik_ibsen",
      "patterns": ["Who is Henrik Ibsen?"],
      "responses": ["Henrik Ibsen was a highly influential Norwegian playwright, often referred to as the 'father of realism' in theatre. His major works include 'A Doll's House' and 'Hedda Gabler.'"]
    },
    {
      "tag": "nobel_peace_prize",
      "patterns": ["What is the Nobel Peace Prize connection to Norway?"],
      "responses": ["The Nobel Peace Prize is awarded annually in Oslo, Norway, according to the will of Alfred Nobel. The other Nobel Prizes are awarded in Stockholm, Sweden."]
    },
    {
      "tag": "wildlife",
      "patterns": ["What kind of wildlife can you see in Norway?"],
      "responses": ["Norway has diverse wildlife including reindeer, moose (elk), arctic foxes, lynx, wolverines, puffins, sea eagles, whales, and in Svalbard, polar bears."]
    },
    {
      "tag": "allemannsretten",
      "patterns": ["What is 'allemannsretten'?"],
      "responses": ["Allemannsretten (the right to roam) is a traditional right in Norway (and other Nordic countries) that grants the public rights to access and passage through uncultivated land, regardless of ownership, provided consideration is shown for nature and landowners."]
    },
    {
      "tag": "snowfall",
      "patterns": ["Does it snow a lot in Norway?"],
      "responses": ["Snowfall varies greatly depending on location and altitude. Coastal areas in the south and west may have milder winters with less snow, while inland areas and the north experience colder winters with significant snowfall, ideal for winter sports."]
    },
    {
      "tag": "gateway_to_fjords",
      "patterns": ["Which city is known as the 'Gateway to the Fjords'?"],
      "responses": ["Bergen is often referred to as the 'Gateway to the Fjords' due to its proximity to famous fjords like Hardangerfjord and Sognefjord."]
    },
    {
      "tag": "royal_family_name",
      "patterns": ["What is the name of the Norwegian Royal Family?"],
      "responses": ["The Norwegian Royal Family belongs to the House of Glücksburg. The current King is Harald V, and the Crown Prince is Haakon."]
    },
    {
      "tag": "tipping",
      "patterns": ["Is tipping common in Norway?"],
      "responses": ["Tipping is not generally expected in Norway as service charges are usually included in bills. However, tipping for exceptional service in restaurants or taxis is appreciated but not obligatory."]
    },
    {
      "tag": "power_plugs",
      "patterns": ["What power plugs are used in Norway?"],
      "responses": ["Norway uses the standard Europlug (Type C) and Schuko plug (Type F), operating on a 230V supply voltage and 50Hz."]
    },
    {
      "tag": "euro_usage",
      "patterns": ["Can I use Euros in Norway?"],
      "responses": ["While some tourist areas might accept Euros, the official currency is the Norwegian Krone (NOK), and it's best to use NOK for most transactions. Credit/debit cards are widely accepted."]
    },
    {
      "tag": "fishing_popularity",
      "patterns": ["Is fishing popular in Norway?"],
      "responses": ["Yes, both coastal and freshwater fishing are very popular recreational activities in Norway, thanks to its long coastline and numerous lakes and rivers."]
    }
  ]
}